---
kind: method
id: M:Autodesk.Revit.DB.LinkElementId.Equals(System.Object)
source: html/b35ef5fb-6492-fa42-424f-a79b7085d0e7.htm
---
# Autodesk.Revit.DB.LinkElementId.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.